jhirsi/sdk-nrf/samples/nrf9160/modem_shell/src/location/location_shell.c
exit:
	if (err) {
		location_cellular_ext_result_set(LOCATION_EXT_RESULT_ERROR, NULL);
	} else {
		location_cellular_ext_result_set(LOCATION_EXT_RESULT_SUCCESS, &location);
	}

	return err;
}
#endif /* CONFIG_LOCATION_METHOD_CELLULAR_EXTERNAL && CONFIG_MOSH_CLOUD_LWM2M */

#if defined(CONFIG_LOCATION_METHOD_CELLULAR_EXTERNAL)
static void location_ctrl_cellular_ext_handle(const struct lte_lc_cells_info *cell_info)
{
#if defined(CONFIG_MOSH_CLOUD_LWM2M)
	int err = -1;

	if (!cloud_lwm2m_is_connected()) {
		mosh_error("LwM2M not connected, can't send cellular location request");
		goto exit;
	}

	err = lwm2m_engine_register_post_write_callback(
		LWM2M_PATH(GROUND_FIX_OBJECT_ID, 0, GROUND_FIX_RESULT_CODE),
		location_ctrl_lwm2m_cell_result_cb);
	if (err) {
		mosh_error("Failed to register post write callback, err: %d", err);
	}

	ground_fix_set_report_back(true);

	err = lwm2m_update_signal_meas_objects(cell_info);
	if (err) {
		mosh_error("Failed to update LwM2M signal meas object, err: %d", err);
		goto exit;
	}

	err = location_assistance_ground_fix_request_send(cloud_lwm2m_client_ctx_get(), true);
	if (err) {
		mosh_error("Failed to send cellular location request, err: %d", err);
		goto exit;
	}

exit:
	if (err) {
		location_cellular_ext_result_set(LOCATION_EXT_RESULT_ERROR, NULL);
	}
#else /* !CONFIG_MOSH_CLOUD_LWM2M */
	location_cellular_ext_result_set(LOCATION_EXT_RESULT_ERROR, NULL);
#endif
}
#endif /* CONFIG_LOCATION_METHOD_CELLULAR_EXTERNAL */

#if defined(CONFIG_MOSH_METRICS)
static void metrics_to_cloud_worker(struct k_work *work_item)
{
	struct metrics_work_data *data = CONTAINER_OF(work_item, struct metrics_work_data, work);
	int ret;
	char *body = NULL;

	ret = location_metrics_utils_json_payload_encode(&data->metrics, &body);
	if (ret) {
		mosh_error("location metrics json encoding failed: %d", ret);
		goto clean_up;
	}
#if defined(CONFIG_NRF_CLOUD_MQTT)
	struct nrf_cloud_tx_data mqtt_msg = {
		.data.ptr = body,
		.data.len = strlen(body),
		.qos = MQTT_QOS_1_AT_LEAST_ONCE,
		.topic_type = NRF_CLOUD_TOPIC_MESSAGE,
	};

	mosh_print("Sending location related metrics to nRF Cloud via MQTT, body: %s", body);
	ret = nrf_cloud_send(&mqtt_msg);
	if (ret) {
		mosh_error("MQTT: location metrics sending failed: %d", ret);
	}
#elif defined(CONFIG_NRF_CLOUD_REST)
#define REST_METRICS_RX_BUF_SZ 300 /* No payload in a response, "just" headers */
	static char rx_buf[REST_METRICS_RX_BUF_SZ];
	static char device_id[NRF_CLOUD_CLIENT_ID_MAX_LEN + 1];
	static struct nrf_cloud_rest_context rest_ctx = { .connect_socket = -1,
							  .keep_alive = false,
							  .rx_buf = rx_buf,
							  .rx_buf_len = sizeof(rx_buf),
							  .fragment_size = 0 };

	ret = nrf_cloud_client_id_get(device_id, sizeof(device_id));
	if (ret) {
		mosh_error("Failed to get device ID, error: %d", ret);
		goto clean_up;
	}

	mosh_print("Sending location related metrics to nRF Cloud via REST, body: %s", body);
	ret = nrf_cloud_rest_send_device_message(&rest_ctx, device_id, body, false, NULL);
	if (ret) {
		mosh_error("REST: location metrics sending failed: %d", ret);
	}
#endif

clean_up:
	if (body) {
		cJSON_free(body);
	}
}
#endif

/******************************************************************************/

void location_ctrl_event_handler(const struct location_event_data *event_data)
{
	int64_t ts_ms = NRF_CLOUD_NO_TIMESTAMP;

#if defined(CONFIG_DATE_TIME)
	int err;

	err = date_time_now(&ts_ms);
	if (err) {
		ts_ms = NRF_CLOUD_NO_TIMESTAMP;
	}
#endif

	switch (event_data->id) {
	case LOCATION_EVT_LOCATION:
		mosh_print("Location:");
		mosh_print(
			"  used method: %s (%d)",
			location_method_str(event_data->method),
			event_data->method);
		mosh_print("  latitude: %.06f", event_data->location.latitude);
		mosh_print("  longitude: %.06f", event_data->location.longitude);
		mosh_print("  accuracy: %.01f m", event_data->location.accuracy);
		if (event_data->location.datetime.valid) {
			mosh_print(
				"  date: %04d-%02d-%02d",
				event_data->location.datetime.year,
				event_data->location.datetime.month,
				event_data->location.datetime.day);
			mosh_print(
				"  time: %02d:%02d:%02d.%03d UTC",
				event_data->location.datetime.hour,
				event_data->location.datetime.minute,
				event_data->location.datetime.second,
				event_data->location.datetime.ms);
		}
#if defined(CONFIG_LOCATION_METRICS)
		mosh_print("  TTF: %.02f secs", event_data->location.details.used_time_sec);
#endif
		mosh_print(
			"  Google maps URL: https://maps.google.com/?q=%f,%f",
			event_data->location.latitude, event_data->location.longitude);

		if (gnss_location_to_cloud) {
			k_work_init(&gnss_location_work_data.work, location_to_cloud_worker);

			gnss_location_work_data.timestamp_ms = ts_ms;
			gnss_location_work_data.loc_evt_data = *event_data;
			gnss_location_work_data.format = gnss_location_to_cloud_format;
#if defined(CONFIG_MOSH_METRICS)
			/* Cannot use the same workq as metrics does, using system workq */
			k_work_submit(&gnss_location_work_data.work);
#else
			k_work_submit_to_queue(&mosh_common_work_q, &gnss_location_work_data.work);
#endif
		}

#if defined(CONFIG_DK_LIBRARY)
		dk_set_led_on(LOCATION_STATUS_LED);
		k_work_reschedule_for_queue(&mosh_common_work_q, &location_evt_led_work,
			K_SECONDS(5));
#endif
		break;

	case LOCATION_EVT_TIMEOUT:
		mosh_error("Location request timed out");
		break;

	case LOCATION_EVT_ERROR:
		mosh_error("Location request failed");
		break;
	case LOCATION_EVT_GNSS_ASSISTANCE_REQUEST:
#if defined(CONFIG_LOCATION_METHOD_GNSS_AGPS_EXTERNAL)
		mosh_print(
			"A-GPS request from Location library "
			"(ephe: 0x%08x alm: 0x%08x flags: 0x%02x)",
			event_data->agps_request.sv_mask_ephe,
			event_data->agps_request.sv_mask_alm,
			event_data->agps_request.data_flags);
		location_ctrl_agps_ext_handle(&event_data->agps_request);
#endif
		break;
	case LOCATION_EVT_GNSS_PREDICTION_REQUEST:
#if defined(CONFIG_LOCATION_METHOD_GNSS_PGPS_EXTERNAL)
		mosh_print(
			"P-GPS request from Location library "
			"(prediction count: %d validity time: %d gps day: %d time of day: %d)",
			event_data->pgps_request.prediction_count,
			event_data->pgps_request.prediction_period_min,
			event_data->pgps_request.gps_day,
			event_data->pgps_request.gps_time_of_day);
		location_ctrl_pgps_ext_handle(&event_data->pgps_request);
#endif
		break;
	case LOCATION_EVT_CELLULAR_EXT_REQUEST:
#if defined(CONFIG_LOCATION_METHOD_CELLULAR_EXTERNAL)
		mosh_print("Cellular location request from Location library "
			   "(neighbor cells: %d GCI cells: %d)",
			   event_data->cellular_request.ncells_count,
			   event_data->cellular_request.gci_cells_count);
		location_ctrl_cellular_ext_handle(&event_data->cellular_request);
#endif
		break;
	case LOCATION_EVT_RESULT_UNKNOWN:
		mosh_print("Location request completed, but the result is not known");
		break;
	default:
		mosh_warn("Unknown event from location library, id %d", event_data->id);
		break;
	}
#if defined(CONFIG_MOSH_METRICS)
	if (metrics_to_cloud) {
		k_work_init(&metrics_work_data.work, metrics_to_cloud_worker);

