jhirsi/sdk-nrf/samples/nrf9160/modem_shell/src/location/location_shell.c
		case '?':
			goto show_usage;

		default:
			mosh_error("Unknown option. See usage:");
			goto show_usage;
		}
	}

	/* Handle location subcommands */
	switch (command) {
	case LOCATION_CMD_CANCEL:
		metrics_to_cloud = false;
		gnss_location_to_cloud = false;
		k_work_cancel(&gnss_location_work_data.work);
#if defined(CONFIG_MOSH_METRICS)
		k_work_cancel(&metrics_work_data.work);
#endif
		ret = location_request_cancel();
		if (ret) {
			mosh_error("Canceling location request failed, err: %d", ret);
			return -1;
		}
		mosh_print("Location request cancelled");
		break;

	case LOCATION_CMD_GET: {
		struct location_config config = { 0 };
		struct location_config *real_config = &config;

		if (method_count == 0 && !interval_set && !timeout_set) {
			/* No methods or top level config given. Use default config. */
			real_config = NULL;
		}

		location_config_defaults_set(&config, method_count, method_list);

		if (use_custom_ncellmeas_resp) {
			lte_lc_ncellmeas_max_resp_enable();
		} else {
			lte_lc_ncellmeas_max_resp_disable();
		}

		for (uint8_t i = 0; i < method_count; i++) {
			if (config.methods[i].method == LOCATION_METHOD_GNSS) {
				if (gnss_timeout_set) {
					config.methods[i].gnss.timeout = gnss_timeout;
				}
				if (gnss_accuracy_set) {
					config.methods[i].gnss.accuracy = gnss_accuracy;
				}
				if (gnss_num_fixes_set) {
					config.methods[i].gnss.num_consecutive_fixes =
						gnss_num_fixes;
				}
				config.methods[i].gnss.visibility_detection = gnss_visibility;
				config.methods[i].gnss.priority_mode = gnss_priority_mode;
			} else if (config.methods[i].method == LOCATION_METHOD_CELLULAR) {
				config.methods[i].cellular.service = cellular_service;
				if (cellular_timeout_set) {
					config.methods[i].cellular.timeout = cellular_timeout;
				}
				if (ncellmeas_gci_count_set) {
					config.methods[i].cellular.ncellmeas_params.gci_count =
						ncellmeas_gci_count;
				}
				if (ncellmeas_search_type_set) {
					config.methods[i].cellular.ncellmeas_params.search_type =
						ncellmeas_search_type;
				}
			} else if (config.methods[i].method == LOCATION_METHOD_WIFI) {
				config.methods[i].wifi.service = wifi_service;
				if (wifi_timeout_set) {
					config.methods[i].wifi.timeout = wifi_timeout;
				}
			}
		}

		if (interval_set) {
			config.interval = interval;
		}
		if (timeout_set) {
			config.timeout = timeout;
		}
		config.mode = req_mode;

		ret = location_request(real_config);
		if (ret) {
			mosh_error("Requesting location failed, err: %d", ret);
			return -1;
		}

#if defined(CONFIG_MOSH_METRICS)
		/* Store current command */
		get_command_str_from_argv(
			argc, argv,
			current_loc_cmd_str,
			LOCATION_METRICS_CMD_STR_MAX_LEN + 1);
#endif
		mosh_print("Started to get current location...");
		break;
	}
	default:
		mosh_error("Unknown command. See usage:");
		goto show_usage;
	}
	return ret;
show_usage:
	/* Reset getopt for another users */
	optreset = 1;

	location_shell_print_usage(shell, command);
	return ret;
}
